// 创建一个一维数组，存入省的值
var arr_sheng = ['陕西省', '云南省', '四川省', '山西省']

// 创建一个二维数组，最外层每一个元素对应省
var arr_shi = [
    // 数组中的第一个元素内又定义一个数组存的市的值
    ['西安市', '汉中市', '宝鸡市', '渭南市'],
    ['昆明市', '保山市', '曲靖市', '昭通市'],
    ['成都市', '乐山市', '达州市', '广安市'],
    ['太原市', '朔州市', '晋城市', '大同市']
]

// 创建一个三维数组，最外层每一个元素（对应省）
var arr_xian = [
    [
        [
            {
                a: '西安市雁塔路授权专卖店',
                p1: '西安市雁塔路中段天成大厦1层55号西安科技大学对面，雁塔路鲁家村车站',
                p2: '18591937275'
            },
            {
                a: '西安市电子正街授权专卖店',
                p1: '西安市雁塔区电子城电子正街224号',
                p2: '18391864122'
            },{
                a: '西安市北大街授权专卖店',
                p1: '西安市莲湖区北大街55号新时代广场1楼南地铁2号线钟楼站D口往北100米',
                p2: '18629141559'
            },{
                a: '西安市小寨授权专卖店',
                p1: '西安市雁塔区小寨西路中豪大厦1层小寨十字向西50米路北',
                p2: '18966689887'
            },{
                a: '西安西北大学认证店',
                p1: '西安市碑林区太白北路316号西北大学西门对面',
                p2: '13519197691'
            }
        ],
        [
            {
                a: '汉中市人民路授权专卖店',
                p1: '汉中市汉台区人民路18号人民路鸿宾楼下',
                p2: '0916—2611234 / 18909161234'
            },{
                a: '汉中市城固县文化路授权专卖店',
                p1: '汉中市城固县文化路西段 新华书店向东20米',
                p2: '0916-7281234 / 18909161234'
            },{
                a: '汉中市汉台区中心广场授权专卖店',
                p1: '汉中市汉台区中心广场北侧白天鹅宾馆一楼',
                p2: '0916-2531234'
            }
        ],
        [
            {
                a: '宝鸡市东岭银泰城授权专卖店',
                p1: '宝鸡市金台区金台大道银泰城西侧东岭新天地C-A03',
                p2: '0917-3626189'
            }
        ], 
        [
            {
                a: '渭南白水白港认证店',
                p1: '渭南市白水县白港大厦南100米路东',
                p2: '15291938355'
            },{
                a: '渭南市中心广场南路授权专卖店',
                p1: '渭南市临渭区广场南路6号渭南市政协附近',
                p2: '0913-2023311/18049595888'
            }
        ]
    ],
    [
        [
            {
                a: '昆明晋城晋东路认证店',
                p1: '昆明市晋宁县晋城镇进江路公路五处8号铺面',
                p2: '15912576189'
            },{
                a: '昆明宜良环城西路认证店',
                p1: '昆明市宜良县环城西路妇幼保健院斜对面（广福苑小区商铺正对面）',
                p2: '0871-67519118'
            },{
                a: '昆明市五华区建设路授权专卖店',
                p1: '昆明市五华区东风西路484-1-1号建设路电影院旁，德克士斜对面',
                p2: '0871-65318499'
            }
        ],
        [
            {
                a: '保山隆阳区认证店',
                p1: '保山市隆阳区九龙路75号九龙路与下巷街T字路口，女人大世界旁',
                p2: '13888515232'
            }
        ],
        [
            {
                a: '曲靖师宗县认证店',
                p1: '曲靖市师宗县漾月西路十佳快捷酒店1楼',
                p2: '0874-6206666'
            },{
                a: '曲靖罗平县认证店',
                p1: '曲靖市罗平县振兴街42号',
                p2: '0874-6137666'
            }
        ],
        [
            {
                a: '昭通市北顺城街授权专卖店',
                p1: '云南省昭通市昭阳区公园路61号魅族专卖店',
                p2: '189 8702 2604'
            }
        ]
    ],
    [
        [
            {
                a: '成都市金牛区蜀汉路授权专卖店',
                p1: '成都市金牛区蜀汉路172号',
                p2: '02879521909'
            },{
                a: '成都市中和授权专卖店',
                p1: '成都市中和镇新下街44号',
                p2: '15608089392'
            },{
                a: '成都市太升南路51号授权专卖店',
                p1: '成都市青羊区太升南路51号认证店',
                p2: '13881790458'
            }
        ],
        [
            {
                a: '乐山市中心城区人民东路授权专卖店',
                p1: '乐山市中心城区炎帝庙街111号魅族授权服务体验店张公桥步行街',
                p2: '17628150292'
            }
        ],
        [
            {
                a: '达州市通川区文华街授权专卖店',
                p1: '达州市通川区文华街中段20号',
                p2: '13684242717'
            }
        ],
        [
            {
                a: '广安市金安大道市粮食局授权专卖店',
                p1: '广安市金安大道1段51号重百商场往天府饭店上行150米市粮食局正对面，广宁市场站台旁',
                p2: '0826-2222499'
            }
        ]
    ],
    [
        [
            {
                a: '太原市南内环阳光科技大厦认证店',
                p1: '太原市南内环阳光科技大厦4层4098',
                p2: '15698575559'
            }
        ],
        [
            {
                a: '朔州市朔城区开发南路授权专卖店',
                p1: '朔州市朔城区开发南路渤海湾宾馆向北200米',
                p2: '0349-2228222-5 / 0349-8998333'
            }
        ],
        [
            {
                a: '晋城阳城县凤凰西街认证店',
                p1: '晋城市阳城县凤凰东街11号',
                p2: '17735674888'
            },{
                a: '晋城市广场街兰花城授权专卖店',
                p1: '晋城市广场前街兰花城南一楼',
                p2: '0356-3055345'
            }
        ],
        [
            {
                p1: "没有专卖点"
            }
        ]
    ]
]

var list = ''
for (var i = 0; i < arr_sheng.length; i++) {
    list += '<li>' + arr_sheng[i] + '</li>'
}
$('#sheng').html(list)

// btn1下拉按钮
$('#btn1').click(function () {
    $(this)
        .siblings('#sheng')
        .slideDown()
    $('#city').html('')
    $('#div').innerHTML = ''
})
var indexs
$('#sheng li').click(function () {
    indexs = $(this).index()
    // 渲染 第二个数据
    $(this)
        .parent()
        .siblings('#spn1')
        .text($(this).text())
    $(this)
        .parent()
        .slideUp()
    // console.log($(this).index());
    // console.log(arr_shi[$(this).index()]);
    var list1 = ''
    for (var i = 0; i < arr_shi.length; i++) {
        list1 += '<li>' + arr_shi[$(this).index()][i] + '</li>'
    }
    document.getElementById('city').innerHTML = list1
})
// btn2下拉按钮
$('#btn2').click(function () {
    $(this)
        .siblings('#city')
        .slideDown()
})

$('#city').on('click', 'li', function () {
    $(this)
        .parent()
        .siblings('#spn2')
        .text($(this).text())
    $(this)
        .parent()
        .slideUp()
    // 获取对应的
    document.getElementById('div').innerHTML = ''
    console.log($(this).index())
    for (var i = 0; i < arr_xian[indexs][$(this).index()].length; i++) {
        var list = ''
        var arrObj = arr_xian[indexs][$(this).index()]
        var div = document.createElement('div')
        div.className = 'on to'
        for (const key in arrObj[i]) {
            console.log(key)
            if (key === 'a') {
                list += '<a href="javaScript:;" class="data_a">' + arrObj[i][key] + '</a>' + '<br />'
            } else if (key === 'p1') {
                list += '<p class="data_p">' + arrObj[i][key] + '</p>' + '<br />'
            } else if (key === 'p2') {
                list += '<p class="data_p">' + arrObj[i][key] + '</p>' + '<br />'
            }
        }
        div.innerHTML = list
        document.getElementById('div').appendChild(div)
    }
})